app/controllers/artists_controller.rb

  def edit
    @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @artist = Artist.new(params[:artist])
    if @artist.save
---
INSERT INTO "artists" ("created_at", "name", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 02 Jul 2013 15:59:20 UTC +00:00], ["name", "Deborah Will"], ["updated_at", Tue, 02 Jul 2013 15:59:20 UTC +00:00], ["url", "http://willoconnell.com/avis_fahey"]]

  def update
    @artist = Artist.find(params[:id])
    if @artist.update_attributes(params[:artist])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "artists" SET "name" = 'Mike', "url" = 'mike.com', "updated_at" = '2013-07-02 18:30:03.625055' WHERE "artists"."id" = 1

  def destroy
    artist = Artist.find(params[:id])
    artist.destroy
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 1]]